def number (n):

    units= ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]

    tens = ["", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]

    number_tens =  ["десять", "одннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать",
                "семнадцать", "восемнадцать", "девятнадцать"]
    if n == 1000:
        return "одна тысяча"
    if 10 <= n < 20:
        return number_tens [n - 10]

    a = n // 100
    b = (n % 100) // 10
    c = n % 10

    result = ""

    if a:
        result += units[a] + "сто"

    if b:
        result += tens[b]

    if c:
        result += units[c]

    return result

n = int(input())
print(number(n))

